tap "codekitchen/dinghy"
tap "eddieantonio/eddieantonio"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "wtfutil/wtfutil"
# Run your GitHub Actions locally 🚀
brew "act"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Arbitrary precision numeric processing language
brew "bc"
# Change macOS display brightness from the command-line
brew "brightness"
# New way to see and navigate directory trees
brew "broot"
# Library for command-line editing
brew "readline"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generic library support script
brew "libtool"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Emacs dependency management
brew "cask"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Dynamic, general-purpose programming language
brew "clojure"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl", args: ["HEAD"]
# Load/unload environment variables based on $PWD
brew "direnv"
# Terminal visual disk space navigator
brew "diskonaut"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Emulates the detach feature of screen
brew "dtach"
# OpenType text shaping engine
brew "harfbuzz"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Google Search and News from the command-line
brew "googler"
# Fulltext search engine and column store
brew "groonga"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Configurable static site generator
brew "hugo"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# DevTools proxy for iOS devices
brew "ios-webkit-debug-proxy"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interactive environments for writing and running code
brew "jupyterlab"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# Multi-format archive and compression library
brew "libarchive"
# Conversion library
brew "libiconv"
# X.509 and CMS library
brew "libksba"
# GNOME XML library
brew "libxml2"
# C XSLT library for GNOME
brew "libxslt"
# YAML Parser
brew "libyaml"
# Securely transfers data between computers
brew "magic-wormhole"
# Drop-in replacement for MySQL
brew "mariadb", link: false
# High performance, distributed memory object caching system
brew "memcached", restart_service: true
# Run a Kubernetes cluster locally
brew "minikube"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Open source relational database management system
brew "mysql", link: false
# Interactive cheatsheet tool for the command-line
brew "navi"
# Utility for managing network connections
brew "netcat"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Optimized BLAS library
brew "openblas"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Cross-platform application and UI framework
brew "qt", link: false
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql", restart_service: true
# Software environment for statistical computing
brew "r"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup-init"
# Fuzzy Finder in rust!
brew "sk"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# SSL tunneling program
brew "stunnel"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# WebSockets the Unix way
brew "websocketd"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Graphical network analyzer and capture tool
brew "wireshark"
# Personal information dashboard for your terminal
brew "wtfutil"
# PDF viewer
brew "xpdf", link: false
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# User-space NFSv3 server
brew "codekitchen/dinghy/unfs3"
# faster, friendlier Docker on OS X
brew "codekitchen/dinghy/dinghy"
# It's like cat(1), but for images.
brew "eddieantonio/eddieantonio/imgcat"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Note taking and to-do application with synchronization capabilities
cask "joplin"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
cask "lyx"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
